package test;

public class StaticRes {

	public static int[] propNum = { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };
	public static int[] propId = { 135, 136, 137, 138, 139, 140, 141, 142, 143,
			144, 145, 146, 147 };
	public static String[] AttainmentName = { "新手引导", "索米亚草原1", "索米亚草原2",
			"怨灵地窟1", "怨灵地窟2", "冰霜大陆1", "冰霜大陆2", "熔岩之岛1", "熔岩之岛2", "通天塔10层",
			"通天塔20层", "通天塔30层", "通天塔40层", "3星索米亚草原", "3星怨灵地窟", "3星冰霜大陆",
			"3星熔岩之岛", "20级英雄1", "20级英雄2", "20级英雄3", "20级英雄4", "20级英雄5",
			"20级英雄6", "20级步兵", "20级猎人", "20级狂战士", "20级牧师", "20级魔法师", "20级锤兵",
			"20级刺客", "20级火枪兵" };
	public static String[] AttainmentCondition = { "完成新手指导。", "击败索米亚草原的boss1",
			"击败索米亚草原的boss2", "击败怨灵大陆的boss3", "击败怨灵大陆的boss4", "击败冰霜大陆的boss5",
			"击败冰霜大陆的boss6", "击败熔岩之岛的boss7", "击败熔岩之岛的boss8", "在通天塔第10层取得胜利",
			"在通天塔第20层取得胜利", "在通天塔第30层取得胜利", "在通天塔第40层取得胜利",
			"在索米亚草原的所有关卡取得3星评价", "在怨灵地窟的所有关卡取得3星评价", "在冰霜大陆的所有关卡取得3星评价",
			"在熔岩之岛的所有关卡取得3星评价", "英雄1升到20级", "英雄2升到20级", "英雄3升到20级", "英雄4升到20级",
			"英雄5升到20级", "英雄6升到20级", "步兵升到20级", "猎人升到20级", "狂战士升到20级",
			"牧师升到20级", "魔法兵升到20级", "锤兵升到20级", "刺客升到20级", "火枪兵升到20级" };
	public static int[] isFinishAttainment = { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };

}
